artillery/scripts/apache-test-2.yml
config:
  target: "http://127.0.0.1:8081"
  phases:
    - duration: 30
      arrivalRate: 1
      rampTo: 5
      name: "Warm up the API"
    - pause: 10
    - duration: 60
      arrivalRate: 5
      rampTo: 20
      name: "Ramp up to peak load"
    - duration: 120
      arrivalRate: 20
      name: "Sustained peak load"
  plugins:
    publish-metrics:
      - type: "prometheus"
        pushgateway: "http://127.0.0.1:9091"
        tags:
          - "testId:apache_test_3"
          - "type:loadtest"
  payload:
    path: "/payloads/data.csv"
    fields:
      - "uuid"
      - "name"
      - "brand"
      - "gender"
      - "price"
      - "description"
      - "primary_color"
      - "label"
      - "size"
      - "kids"

scenarios:
  - flow:
    - get:
        url: "/"
    - loop:
        - think: 2s
        - get:
            url: "/clothings/{{ uuid }}"
      count: 20