artillery/scripts/apache-test-3.yml
config:
  target: "http://127.0.0.1:8081"
  phases:
    - duration: 60
      arrivalRate: 1
      rampTo: 5
      name: "Warm up the API"
    - duration: 120
      arrivalRate: 5
      rampTo: 10
      name: "Ramp up to peak load"
    - duration: 300
      arrivalRate: 10
      rampTo: 30
      name: "Sustained peak load"
  plugins:
    publish-metrics:
      - type: "prometheus"
        pushgateway: "http://127.0.0.1:9091"
        tags:
          - "testId:apache_test_3"
          - "type:loadtest"
  payload:
    path: "/payloads/data.csv"
    fields:
      - "uuid"
      - "name"
      - "brand"
      - "gender"
      - "price"
      - "description"
      - "primary_color"
      - "label"
      - "size"
      - "kids"

scenarios:
  - flow:
    - get:
        url: "/"
    - think: 1s
    - get:
        url: "/api/clothings"
        qs:
          name: "{{ name }}"
        capture:
          json: "$.results[0]._links.webui"
          as: "product_url"
    - think: 2s
    - get:
        url: "{{ product_url }}"
    - think: 10s